# Acquisition A

4) In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data.

Create a pandas dataframe, df_iris, from this data.

In [359]:
import pandas as pd

from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from pydataset import data
from acquire import get_iris_data, get_titanic_data, get_telco_data

In [360]:
#load the iris data and create a dataframe
df_iris = data('iris')

a) print the first 3 rows

In [361]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

b) print the number of rows and columns (shape)

In [362]:
df_iris.shape

(150, 5)

c) print the column names

In [363]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

d) print the data type of each column

In [364]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

e) print the summary statistics for each of the numeric variables

In [365]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

5) Read the data from this google sheet into a dataframe, df_google.

In [366]:
#read the google_train.xlsx file and create a dataframe; df_google
df_google = pd.read_excel('google_train.xlsx')

a) print the first 3 rows

In [367]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

b) print the number of rows and columns

In [368]:
df_google.shape

(891, 12)

c) print the column names

In [369]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

d) print the data type of each column

In [370]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

e) print the summary statistics for each of the numeric variables

In [371]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

f) print the unique values for each of your categorical variables

In [372]:
df_google.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

6) Download the previous exercise's file into an excel (File → Download → Microsoft Excel). Read the downloaded file into a dataframe named df_excel.

In [373]:
#read the movie_data csv file and creat a dataframe; df_excel
df_excel = pd.read_excel('google_train.xlsx')

a) assign the first 100 rows to a new dataframe, df_excel_sample

In [374]:
#assign the first 100 rows of the dataframe, df_excel to df_excel_sample
df_excel_sample = df_excel.head(100)

b) print the number of rows of your original dataframe

In [375]:
#use 0 in a square bracket to get the first index from the .shape method
df_excel.shape[0]

891

c) print the first 5 column names

In [376]:
#use a colon and square brackets(5) to return the first five column names of the DataFrame df_excel
df_excel.columns[:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

d) print the column names that have a data type of object

In [377]:
#Filter columns with the data type 'object'
df_excel.dtypes[df_excel.dtypes == 'object']

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

e) compute the range for each of the numeric variables.

In [378]:
#calculate the range for each numeric column in the DataFrame 'df_excel' using the .describe function
df_excel.describe().loc['max'] - df_excel.describe().loc['min']

PassengerId    890.0000
Survived         1.0000
Pclass           2.0000
Age             79.5800
SibSp            8.0000
Parch            6.0000
Fare           512.3292
dtype: float64

# Preparation

- Using the Iris Data:

  1) Use the function defined in acquire.py to load the iris data.

In [379]:
iris_df = get_iris_data()
iris_df.head()

,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_id,species_id.1,species_name
0,1,5.1,3.5,1.4,0.2,1,1,setosa
1,2,4.9,3.0,1.4,0.2,1,1,setosa
2,3,4.7,3.2,1.3,0.2,1,1,setosa
3,4,4.6,3.1,1.5,0.2,1,1,setosa
4,5,5.0,3.6,1.4,0.2,1,1,setosa

2) Drop the species_id and measurement_id columns.

In [380]:
iris_df = iris_df.drop(columns = ['species_id', 'species_id.1', 'measurement_id'])

In [381]:
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width species_name
0           5.1          3.5           1.4          0.2       setosa
1           4.9          3.0           1.4          0.2       setosa
2           4.7          3.2           1.3          0.2       setosa
3           4.6          3.1           1.5          0.2       setosa
4           5.0          3.6           1.4          0.2       setosa

3) Rename the species_name column to just species.

In [382]:
iris_df = iris_df.rename(columns = {'species_name': 'species'})
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

5) Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [383]:
def prep_iris():
    iris_df = get_iris_data()  
    iris_df = iris_df.drop(columns=['species_id', 'measurement_id'])
    iris_df = iris_df.rename(columns={'species_name': 'species'})
    return iris_df

In [384]:
prep_iris().head()

   sepal_length  sepal_width  petal_length  petal_width  species_id.1 species
0           5.1          3.5           1.4          0.2             1  setosa
1           4.9          3.0           1.4          0.2             1  setosa
2           4.7          3.2           1.3          0.2             1  setosa
3           4.6          3.1           1.5          0.2             1  setosa
4           5.0          3.6           1.4          0.2             1  setosa

- Using the Titanic dataset

 1) Use the function defined in acquire.py to load the Titanic data.

In [385]:
titanic_df = get_titanic_data()
titanic_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

2) Drop any unnecessary, unhelpful, or duplicated columns.

In [386]:
titanic_df = titanic_df.drop(columns = ['passenger_id', 'pclass', 'embarked'])
titanic_df.head()

,survived,sex,age,sibsp,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,NaN,Southampton,0
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,0
2,1,female,26.0,0,0,7.9250,Third,NaN,Southampton,1
3,1,female,35.0,1,0,53.1000,First,C,Southampton,0
4,0,male,35.0,0,0,8.0500,Third,NaN,Southampton,1

4) Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [387]:
def prep_titanic():
    titanic_df = get_titanic_data()
    titanic_df = titanic_df.drop(columns=['passenger_id', 'pclass', 'embarked'])
    return titanic_df

In [388]:
prep_titanic().head()

,survived,sex,age,sibsp,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,NaN,Southampton,0
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,0
2,1,female,26.0,0,0,7.9250,Third,NaN,Southampton,1
3,1,female,35.0,1,0,53.1000,First,C,Southampton,0
4,0,male,35.0,0,0,8.0500,Third,NaN,Southampton,1

- Using the Telco dataset

  1) Use the function defined in acquire.py to load the Telco data.

In [389]:
telco_df = get_telco_data()
telco_df.head().T

,0,1,2,3,4
customer_id,0002-ORFBO,0003-MKNFE,0004-TLHLJ,0011-IGKFF,0013-EXCHZ
gender,Female,Male,Male,Male,Female
senior_citizen,0,0,0,1,1
partner,Yes,No,No,Yes,Yes
dependents,Yes,No,No,No,No
tenure,9,9,4,13,3
phone_service,Yes,Yes,Yes,Yes,Yes
multiple_lines,No,Yes,No,No,No
internet_service_type_id,1,1,2,2,2
online_security,No,No,No,No,No
online_backup,Yes,No,No,Yes,No
device_protection,No,No,Yes,Yes,No
tech_support,Yes,No,No,No,Yes
streaming_tv,Yes,No,No,Yes,Yes
streaming_movies,No,Yes,No,Yes,No
contract_type_id,2,1,1,1,1
paperless_billing,Yes,No,Yes,Yes,Yes
payment_type_id,2,2,1,1,2
monthly_charges,65.6,59.9,73.9,98.0,83.9
total_charges,593.3,542.4,280.85,1237.85,267.4
churn,No,No,Yes,Yes,Yes
contract_type_id.1,2,1,1,1,1
contract_type,One year,Month-to-month,Month-to-month,Month-to-month,Month-to-month
internet_service_type_id.1,1,1,2,2,2
internet_service_type,DSL,DSL,Fiber optic,Fiber optic,Fiber optic
payment_type_id.1,2,2,1,1,2
payment_type,Mailed check,Mailed check,Electronic check,Electronic check,Mailed check

2) Drop any unnecessary, unhelpful, or duplicated columns. 

This could mean dropping foreign key columns but keeping the corresponding string values, for example.

In [390]:
telco_df = telco_df.drop(columns = ['contract_type_id', 'contract_type_id.1', 
                         'internet_service_type_id', 'internet_service_type_id.1', 
                         'payment_type_id.1', 'payment_type_id'])
telco_df.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

4) Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

In [391]:
def prep_telco():
    telco_df = get_telco_data()
    telco_df = telco_df.drop(columns = ['contract_type_id', 'contract_type_id.1', 
                         'internet_service_type_id', 'internet_service_type_id.1', 
                         'payment_type_id.1', 'payment_type_id'])
    return telco_df

In [392]:
prep_telco().head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

- Split your data

  1) Write a function to split your data into train, test and validate datasets. Add this function to prepare.py.

In [393]:
def train_val_test(df, strat, seed = 42):

    train, val_test = train_test_split(df, train_size = 0.7, random_state = seed, stratify = df[strat])

    val, test = train_test_split(val_test, train_size = 0.5, random_state = seed, stratify = val_test[strat])

    return train, val, test

2) Run the function in your notebook on the Iris dataset, returning 3 datasets, train_iris, validate_iris and test_iris

In [394]:
train_iris, validate_iris, test_iris = train_val_test(iris_df, strat = 'species')

In [416]:
train_iris.shape, test_iris.shape, validate_iris.shape

((105, 5), (23, 5), (22, 5))

In [395]:
train_iris.head()

     sepal_length  sepal_width  petal_length  petal_width     species
98            5.1          2.5           3.0          1.1  versicolor
68            6.2          2.2           4.5          1.5  versicolor
19            5.1          3.8           1.5          0.3      setosa
143           6.8          3.2           5.9          2.3   virginica
99            5.7          2.8           4.1          1.3  versicolor

In [396]:
validate_iris.head()

     sepal_length  sepal_width  petal_length  petal_width     species
77            6.7          3.0           5.0          1.7  versicolor
111           6.4          2.7           5.3          1.9   virginica
69            5.6          2.5           3.9          1.1  versicolor
133           6.3          2.8           5.1          1.5   virginica
141           6.9          3.1           5.1          2.3   virginica

In [397]:
test_iris.head()

     sepal_length  sepal_width  petal_length  petal_width     species
18            5.7          3.8           1.7          0.3      setosa
38            4.4          3.0           1.3          0.2      setosa
134           6.1          2.6           5.6          1.4   virginica
57            4.9          2.4           3.3          1.0  versicolor
127           6.1          3.0           4.9          1.8   virginica

3) Run the function on the Titanic dataset, returning 3 datasets, train_titanic, validate_titanic and test_titanic.

In [398]:
train_titanic, validate_titanic, test_titanic = train_val_test(titanic_df, strat = 'survived')

In [410]:
train_titanic.isnull().sum()

survived         0
sex              0
age            119
sibsp            0
parch            0
fare             0
class            0
deck           488
embark_town      2
alone            0
dtype: int64

In [417]:
train_titanic.shape, test_titanic.shape, validate_titanic.shape

((623, 10), (134, 10), (134, 10))

In [399]:
train_titanic.head()

,survived,sex,age,sibsp,parch,fare,class,deck,embark_town,alone
748,0,male,19.0,1,0,53.1000,First,D,Southampton,0
45,0,male,NaN,0,0,8.0500,Third,NaN,Southampton,1
28,1,female,NaN,0,0,7.8792,Third,NaN,Queenstown,1
633,0,male,NaN,0,0,0.0000,First,NaN,Southampton,1
403,0,male,28.0,1,0,15.8500,Third,NaN,Southampton,0

In [400]:
validate_titanic.head()

,survived,sex,age,sibsp,parch,fare,class,deck,embark_town,alone
377,0,male,27.0,0,2,211.500,First,C,Cherbourg,0
244,0,male,30.0,0,0,7.225,Third,NaN,Cherbourg,1
72,0,male,21.0,0,0,73.500,Second,NaN,Southampton,1
815,0,male,NaN,0,0,0.000,First,B,Southampton,1
841,0,male,16.0,0,0,10.500,Second,NaN,Southampton,1

In [401]:
test_titanic.head()

,survived,sex,age,sibsp,parch,fare,class,deck,embark_town,alone
455,1,male,29.0,0,0,7.8958,Third,NaN,Cherbourg,1
607,1,male,27.0,0,0,30.5000,First,NaN,Southampton,1
142,1,female,24.0,1,0,15.8500,Third,NaN,Southampton,0
883,0,male,28.0,0,0,10.5000,Second,NaN,Southampton,1
835,1,female,39.0,1,1,83.1583,First,E,Cherbourg,0

4) Run the function on the Telco dataset, returning 3 datasets, train_telco, validate_telco and test_telco.

In [402]:
train_telco, validate_telco, test_telco = train_val_test(telco_df, strat = 'churn')

In [418]:
train_telco.shape, test_telco.shape, validate_titanic.shape

((4930, 21), (1057, 21), (134, 10))

In [403]:
train_telco.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
5609,7901-HXJVA,Male,0,No,No,14,Yes,No,No,No,...,No,No,No,No,76.45,1117.55,No,Month-to-month,Fiber optic,Electronic check
2209,3164-AALRN,Male,0,No,No,5,Yes,No,No,No,...,No,Yes,Yes,Yes,70.00,347.4,Yes,One year,DSL,Mailed check
6919,9821-POOTN,Male,0,Yes,No,35,Yes,Yes,No,No,...,No,No,No,Yes,75.20,2576.2,Yes,Month-to-month,Fiber optic,Electronic check
2284,3259-QMXUN,Male,0,Yes,No,58,Yes,Yes,Yes,Yes,...,No,Yes,Yes,Yes,86.10,4890.5,No,Two year,DSL,Electronic check
845,1226-UDFZR,Female,0,No,No,2,Yes,No,No,Yes,...,No,No,No,Yes,49.60,114.7,Yes,Month-to-month,DSL,Mailed check

In [404]:
validate_telco.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
6910,9805-FILKB,Male,0,Yes,Yes,46,Yes,No,No internet service,No internet service,...,No internet service,No internet service,No internet service,Yes,20.20,845.6,No,One year,NaN,Bank transfer (automatic)
6044,8564-LDKFL,Male,0,Yes,No,40,Yes,Yes,No,Yes,...,No,Yes,Yes,Yes,106.00,4178.65,No,One year,Fiber optic,Bank transfer (automatic)
2153,3088-FVYWK,Male,0,Yes,Yes,53,Yes,Yes,No internet service,No internet service,...,No internet service,No internet service,No internet service,No,25.55,1336.1,No,Two year,NaN,Credit card (automatic)
2089,2996-XAUVF,Male,0,No,No,70,No,No phone service,No,No,...,Yes,No,Yes,Yes,40.05,2799.75,No,Two year,DSL,Mailed check
6393,9057-SIHCH,Female,0,No,No,3,Yes,Yes,No,No,...,No,Yes,Yes,Yes,96.60,291.9,Yes,Month-to-month,Fiber optic,Electronic check

In [405]:
test_telco.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
1628,2369-UAPKZ,Male,0,No,No,5,Yes,Yes,No,Yes,...,No,Yes,Yes,No,104.10,541.9,Yes,Month-to-month,Fiber optic,Mailed check
3829,5380-XPJNZ,Female,0,No,No,38,Yes,No,No internet service,No internet service,...,No internet service,No internet service,No internet service,No,20.05,678.2,No,One year,NaN,Mailed check
833,1215-VFYVK,Female,0,No,No,4,No,No phone service,Yes,No,...,Yes,No,Yes,No,48.25,202.25,No,Month-to-month,DSL,Mailed check
2956,4223-BKEOR,Female,0,No,Yes,21,Yes,No,Yes,No,...,No,No,Yes,No,64.85,1336.8,No,One year,DSL,Mailed check
5446,7665-NKLAV,Female,0,Yes,Yes,36,No,No phone service,Yes,No,...,Yes,No,No,No,40.65,1547.35,No,Two year,DSL,Credit card (automatic)